In [2]:
import sqlite3
import pandas as pd
conn = sqlite3.Connection('im.db2')

In [3]:
#getting db names
cursor = conn.cursor()
cursor.execute("""SELECT name
    FROM sqlite_master
    WHERE type = 'table';""")
print(cursor.fetchall())

[('movie_basics',), ('directors',), ('known_for',), ('movie_akas',), ('movie_ratings',), ('persons',), ('principals',), ('writers',)]

In [4]:
#loading the dataset
df = pd.read_sql("""SELECT * FROM directors;""",conn).head()
df

    movie_id  person_id
0  tt0285252  nm0899854
1  tt0462036  nm1940585
2  tt0835418  nm0151540
3  tt0835418  nm0151540
4  tt0878654  nm0089502

In [5]:
#loading the dataset
pd.read_sql("""SELECT * FROM principals;""",conn).head()

    movie_id  ordering  person_id  category       job        characters
0  tt0111414         1  nm0246005     actor      None       ["The Man"]
1  tt0111414         2  nm0398271  director      None              None
2  tt0111414         3  nm3739909  producer  producer              None
3  tt0323808        10  nm0059247    editor      None              None
4  tt0323808         1  nm3579312   actress      None  ["Beth Boothby"]

In [6]:
df.info

<bound method DataFrame.info of     movie_id  person_id
0  tt0285252  nm0899854
1  tt0462036  nm1940585
2  tt0835418  nm0151540
3  tt0835418  nm0151540
4  tt0878654  nm0089502>

In [7]:
(df.isnull().sum())

movie_id     0
person_id    0
dtype: int64

In [8]:
conn.close()